Repository: 9221352555/ACFYandex
Catalog: lang/acfyandex-*.po
Languages: ru_ru

source: ACF:Yandex
ru_ru: ACF:Яндекс

source: ACF:Yandex [Settings]
ru_ru: ACF:Яндекс [Настройки]

source: Settings updated!
ru_ru: Настройки обновлены!

source: Error! Could not update data.
ru_ru: Ошибка! Не мог обновить данные.

source: Yandex map
ru_ru: Яндекс карта

source: This key is optional. For high loads or frequent failures, we recommend that you obtain the API key of this service.<BR><a href = "https://yandex.ru/legal/maps_api/">Terms of Use for the Yandex Card API Service </a><BR><a href = "https://developer.tech.yandex.ru/services/"> Get API Key </a> (click Connect API and select Static API Yandex.Cards, registration is required)
ru_ru: Использование данного ключа не является обязательным. При высоких нагрузках или частых отказах рекомендуем получить API ключ данного сервиса.<BR><a href="https://yandex.ru/legal/maps_api/">Условия использования сервиса API карт Яндекса</a><BR><a href="https://developer.tech.yandex.ru/services/">Получить API ключ</a> (нажать кнопку "Подключить API" и выбрать пункт "Static API Яндекс.Карт", требуется регистрация)

source: JavaScript API и HTTP Geocoder
ru_ru: JavaScript API и HTTP Геокодер

source: Zoom by default
ru_ru: Масштаб карты по умолчанию

source: Find out the coordinates of points at
ru_ru: Узнать координаты точек можно по адресу

source: Record example: "55.753923,37.620690"
ru_ru: Пример записи: "55.753923,37.620690"

source: Shortcode to publish
ru_ru: Шорткод для публикации

source: For the shortcode to work, be sure to specify one of the two parameters "_field" or "point". You can find out more about shortcode parameters.
ru_ru: Для работы шорткода обязательно указать один из двух параметров "_field" или "point". Подробнее о параметрах шорткода можно узнать.

source: here
ru_ru: здесь

source: _field - name of the ACF field from which point <BR> values ​​will be substituted<BR>point - coordinates of the point (example of an entry: "55.76, 37.64")<BR>style_width, style_height - width and height of the map block <BR>class - connect css style to the map block<BR>zoom - map zoom, value from 1 to 19 (the default value can be configured in the <a href="./options-general.php?page=menu_acfyandex_plugin"> menu Settings => ACF-Yandex => Zoom by default </a>)<BR>title - signature for the point<BR>memo - description when pressing<BR>By default, a point is formed with the specified coordinates, the title of the post (page) is used as a signature, if the post or page contains a thumbnail and an excerpt, then this data will be inserted into the description when clicked. The data specified in the shortcode parameters are priority.
ru_ru: _field - имя ACF поля, из которого будут подставлены значения point<BR>point - координаты точки (пример записи: "55.76, 37.64")<BR>style_width, style_height - ширина и высота блока карты<BR>class - подключить стиль css к блоку карты<BR>zoom - зум карты, значение от 1 до 19 (значение по умолчанию можно нстроить в меню <a href="./options-general.php?page=menu_acf_plugin_yandex">Настройки => ACF-Yandex => Zoom по умолчанию</a>)<BR>title - подпись для точки<BR>memo - описание при нажатии<BR>По умолчанию формируется точка с указанными координатами, в качестве подписи используется заголовок поста (страницы), если пост или страница содержит миниатюру и отрывок, то эти данные будут вставлены в описание при нажатии. Данные указанные в параметрах шорткода являются приоритетными.
